# 2.10 Поразрядная сортировка дат (datesort.c)
Составьте программу datesort.c, осуществляющую сортировку последовательности дат по возрастанию. В программе должен быть реализован алгоритм поразрядной сортировки, адаптированный для случая, когда ключи представляются в системе счисления с основаниями, зависящими от разряда.

В программе сортируемая последовательность должна быть представлена в виде массива структур Date:
```
struct Date {
    int Day, Month, Year;
};
```
Поле Day может принимать значения от $1$ до $31$, поле Month — от $1$ до $12$, а поле Year — от $1970$ до $2030$.

Последовательность дат считывается из стандартного потока ввода. При этом в самом начале считывается общее количество дат, а каждая дата представляется тройкой чисел «yyyy mm dd».

Например, если введена последовательность:
```
5
2005 01 12
1977 02 01
1994 03 01
2004 02 29
1977 08 01
```
то программа должна выводить в стандартный поток вывода:
```
1977 02 01
1977 08 01
1994 03 01
2004 02 29
2005 01 12
```
Указание. Формат вывода для printf(): "%04d %02d %02d".
